{
  "application_volume": "",
  "category": "$250-350K Package",
  "company": "Aurec",
  "debug": {
    "details_length": 3138,
    "extracted_company": "Aurec",
    "extracted_title": "Senior Software Engineer - Python - Platform - Data",
    "title_length": 96
  },
  "details": "Senior Software Engineer - Python - Platform - Data\nAurec\nSydney NSW\nEngineering - Software (Information & Communication Technology)\nFull time\n$250-350K Package\nPosted 16d ago\n•\nHigh application volume\nHow you match\nMatches based on your career history\nAWS\nPipelines\nAutomation\n+1 more\n⁠\nSoftware Engineer - Python - Platform - Data\nWho they are\nA global fintech powerhouse is looking for a\nSoftware Engineer\nto help design, build and scale data platforms that sit at the heart of their world-class trading and research operations. This is a high-impact engineering role, ideal for someone who blends strong software fundamentals with a passion for data systems, performance optimisation, and infrastructure reliability.\nThe role\nYou'll join a research-aligned engineering team, focused on building high-performance systems that process large volumes of market data. You'll collaborate with global teams to evolve data infrastructure, improve tooling, and ensure researchers and traders have access to fast, reliable, and cost-efficient data pipelines.\nKey responsibilities:\nPlatform and Tooling development\nDesign and build scalable data pipelines using Python & Spark\nDevelop and maintain software components that support research workflows\nImplement observability, monitoring, and tuning for system performance and throughput\nOptimise resource usage and infrastructure costs (especially in cloud environments like AWS)\nContribute to tooling, automation, and internal platform improvements\nDocument best practices and guide engineering decisions with a long-term mindset\nMentor junior engineers and contribute to the growth of the Sydney team\nWhat you'll bring\nExtensive software engineering experience with a focus on back-end platforms with Python Data Systems\nStrong programming skills in\nPython\n(bonus if you've used C++, Rust)\nFamiliarity with modern tools such as PostgreSQL, AWS, Kafka, Spark\nProven experience working on high availabilty / global distributed systems\nStrong problem-solving skills - you enjoy diving deep into performance, reliability, and scale\nWhy join?\nWork on software that directly enables research and trading decisions\nTackle complex engineering problems alongside world-class peers\nBlended software development, Platform & data engineering thinking in one role\nCompetitive salary + industry leading bonuses\nDaily breakfast, lunch and in-house barista\nAnnual company trips + regular team events\nVisa sponsorship and relocation support if required\nIf you're a software engineer who thrives on solving platform & data challenges at scale, this is your chance to make an impact in one of the most advanced trading environments in the world.\nDon’t provide your bank or credit card details when applying for jobs.\nFeatured jobs\nSoftware Programmer\nVision InfoSoft\nNewtown, Sydney NSW\n9d ago\nBack End (Python, AWS, Mobile) Engineer\nTechThinking Talent\nMachine Learning Engineer - Capital Investment - Data & AI - Sydney\nThe Argyle Network\nResearching careers? Find all the information and tips you need on career advice.\nRole descriptions\nSalary insights\nTools to help you prepare for jobs\nExplore Career Advice",
  "jobId": "86897889",
  "location": "Sydney NSW",
  "posted": "",
  "raw_title": "Senior Software Engineer - Python - Platform - Data\nAurec\nSydney NSW\nFull time\n$250-350K Package",
  "salary_note": "$250-350K Package",
  "scrapedAt": "2025-09-18T04:52:34.963Z",
  "title": "Senior Software Engineer - Python - Platform - Data",
  "url": "https://www.seek.com.au/rust-jobs/in-All-Sydney-NSW?jobId=86897889&type=standard",
  "work_type": "Full time"
}