{
  "application_volume": "",
  "category": "",
  "company": "Nuage Technology Group",
  "debug": {
    "details_length": 1782,
    "extracted_company": "Nuage Technology Group",
    "extracted_title": "AI Engineer",
    "title_length": 64
  },
  "details": "AI Engineer\nNuage Technology Group\nSydney NSW\n(Hybrid)\nEngineering - Software (Information & Communication Technology)\nFull time\nPosted 2d ago\n•\nMedium application volume\nHow you match\nMatches based on your career history\nSoftware Development\nDevOps\nJava Programming\n+1 more\n⁠\nThis company has ambitious growth plans over the next 12 months and several greenfield GenAI projects in the pipeline, leveraging the latest technologies on the market. We're looking for engineers who are passionate about AI and staying up to date with the latest trends. You'll be a hands-on engineer who thrives on solving large-scale problems. The role requires strong cloud experience, with responsibility for building and owning your own infrastructure and code day-to-day.\nThis is a rare opportunity to join one of Australia's top AI teams, credited with delivering some of the country's largest GenAI production environments. You'll gain immediate hands-on exposure to a highly regarded technical stack.\nExperience required:\nSoftware engineering (Python, Java, Go, Rust)\nGenAI exposure (hands-on with Vertex, Bedrock, OpenAI)\nWorking knowledge of RAG\nExposure to MCP\nDevOps knowledge (IaC, containers, serverless)\nWe have multiple openings from Mid to Principal level. All positions are hands-on and build-focused. Roles need to be filled quickly and involve a short, two-stage interview process.\nFollow the Nuage page for updates on open positions.\nDon’t provide your bank or credit card details when applying for jobs.\nFeatured job\nApplied Scientist - AI Inference (Agentic AI startup)\nNinjaTech AI Australia Pty Ltd\n3d ago\nResearching careers? Find all the information and tips you need on career advice.\nRole descriptions\nSalary insights\nTools to help you prepare for jobs\nExplore Career Advice",
  "jobId": "87199645",
  "location": "Sydney NSW (Hybrid)",
  "posted": "",
  "raw_title": "AI Engineer\nNuage Technology Group\nSydney NSW (Hybrid)\nFull time",
  "salary_note": "",
  "scrapedAt": "2025-09-18T03:51:03.922Z",
  "title": "AI Engineer",
  "url": "https://www.seek.com.au/rust-jobs/in-All-Sydney-NSW?jobId=87199645&type=standard",
  "work_type": "Full time"
}