{
  "application_volume": "",
  "category": "Competitive",
  "company": "Robert Walters",
  "debug": {
    "details_length": 3201,
    "extracted_company": "Robert Walters",
    "extracted_title": "Software Engineer - Data Systems",
    "title_length": 89
  },
  "details": "Software Engineer - Data Systems\nRobert Walters\nSydney NSW\n(Hybrid)\nStockbroking & Trading (Banking & Financial Services)\nFull time\nCompetitive\nPosted 13d ago\n•\nMedium application volume\nHow you match\nMatches based on your career history\nSoftware Development\nAWS\nPipelines\n+2 more\n⁠\nWe are looking for a Software Engineer to help shape the future of our clients data infrastructure. This role is perfect for someone who is passionate about building high-performance software systems that support large-scale data processing and analytics.\nAs part of this position, you will work closely with researchers and engineers locally and globally to design and implement scalable software solutions that enable seamless access to high-quality data. You'll have the opportunity to develop custom tools, optimize system performance, and contribute to the overall data strategy.\nKey Responsibilities:\nCustom Software Development:\nDesign and build bespoke software components for data pipelines using Python or other programming languages (e.g., C++, Rust).\nData Pipeline Engineering:\nArchitect and maintain robust, scalable data pipelines leveraging technologies like Spark, Databricks, and proprietary high-performance computing tools.\nSystem Optimization:\nMonitor system performance to ensure low latency, high throughput, and cost efficiency.\nCollaboration Across Teams:\nWork with global teams to align on tools, strategies, and best practices for data engineering.\nMonitoring & Reliability:\nImplement monitoring tools to ensure reliability and smooth operation of real-time data streams.\nDocumentation & Standards:\nCreate clear documentation for software architectures, processes, and best practices.\nMentorship & Leadership:\nProvide technical guidance to junior engineers while contributing to the growth of the software engineering function in Sydney.\nABOUT YOU\n3+ years of experience in software or data engineering roles.\nStrong proficiency in Python; familiarity with system-level programming languages like C++ or Rust is advantageous.\nExperience designing custom software solutions for distributed systems or large-scale data processing pipelines.\nKnowledge of modern data engineering concepts such as distributed computing frameworks (e.g., Spark) or real-time streaming technologies (e.g., Kafka).\nFamiliarity with cloud-based architectures (e.g., AWS) and relational databases (e.g., PostgreSQL).\nA proven ability to lead projects independently while delivering high-quality results under tight deadlines.\nExcellent problem-solving skills with a focus on scalability, efficiency, and cost-effectiveness.\nStrong communication skills to effectively convey technical concepts across diverse teams.\nAboriginal and Torres Strait Islander Peoples are encouraged to apply. To apply please click apply or call Sean Yates on\n+61 2 82893163\nfor a confidential discussion.\nDon’t provide your bank or credit card details when applying for jobs.\nFeatured jobs\nSoftware Programmer\nVision InfoSoft\nNewtown, Sydney NSW\n8d ago\nOvernight Sleep Technician\nSomaHealth Sleep and Respiratory\nLeichhardt, Sydney NSW\nSAS Developer\nWhizdom\n25d ago\nWhat can I earn as a Software Engineer\nSee more detailed salary information",
  "jobId": "86969873",
  "location": "Sydney NSW (Hybrid)",
  "posted": "",
  "raw_title": "Software Engineer - Data Systems\nRobert Walters\nSydney NSW (Hybrid)\nFull time\nCompetitive",
  "salary_note": "",
  "scrapedAt": "2025-09-18T03:50:43.542Z",
  "title": "Software Engineer - Data Systems",
  "url": "https://www.seek.com.au/rust-jobs/in-All-Sydney-NSW?jobId=86969873&type=standard",
  "work_type": "Full time"
}