{
  "application_volume": "",
  "category": "Relocation Assistance",
  "company": "Hays | Defence",
  "debug": {
    "details_length": 4010,
    "extracted_company": "Hays | Defence",
    "extracted_title": "Software Discipline Lead",
    "title_length": 82
  },
  "details": "Software Discipline Lead\nHays | Defence\nSydney NSW\nSystems Engineering (Engineering)\nFull time\nRelocation Assistance\nPosted 6d ago\n•\nLow application volume\nExcellent new opportunity to lead a diverse team delivering innovative defence technology\nYour new company\nBased in the surf coast of Victoria, this organisation is centrally situated in Victoria's ever-growing defence epicentre for manufacturing and innovative technology.\nYour new company has an exceptional reputation amongst the defence industry. They are a forward-thinking, high-calibre defence company delivering cutting-edge solutions that can be utilised across all defence platforms and domains. Positioned at a critical growth phase, it offers an exceptional opportunity for a technically skilled and people-focused leader to shape the trajectory of a motivated, high-performing software engineering team. Innovative and dynamic, the company embraces modern tech to develop top-tier defence products and operates across diverse military vehicles. This is a chance to lead by example, using strong technical and interpersonal skills, within a culture that encourages career progression not only for yourself but for your entire team. It's a career-defining move, perfect for someone ready to make a lasting impact in a fast-evolving industry.\nYour new role\nThis leadership role oversees all software development activities, combining deep technical expertise with team management to deliver scalable, high-performance systems integrated into advanced platforms. The position spans the full development lifecycle-from design through to verification-while contributing to strategic technology roadmaps and innovation. Responsibilities include leading a high-performing engineering team, managing tasks and progress using tools like Jira, mentoring staff, and ensuring timely project delivery. You'll own architectural vision, guide development and modern frameworks, and ensure system quality, maintainability, and compliance with industry standards.\nWhat you'll need to succeed\nEssential Qualifications\nAbility to relocate to Victoria (assistance provided).\nAustralian Citizenship - mandatory\nSolid track record of leading software teams with a strong commercial mindset.\nExpertise in designing and deploying distributed software architectures.\nDeep knowledge of design patterns, algorithms, and data structures.\nProven technical leadership in engineering or management roles.\nHands-on experience with both Agile and Waterfall development methodologies.\nSkilled in using JIRA or equivalent tools for project management and collaboration.\nExceptional communication skills, with the ability to engage effectively across teams and stakeholders.\nPrevious hands on experience in software development e.g. using C++, Rust, or other systems-level languages.\nPreferred Skills & Background\nDegree in Computer Science, Software Engineering, or a related discipline (Bachelor's or Master's).\nWorking knowledge of containerisation (Docker) and orchestration (Kubernetes).\nExperience with military-grade or advanced simulation systems.\nIndustry-recognised certifications in software architecture or cloud platforms.\nWhat you'll get in return\nOn offer is a highly rewarding career opportunity with excellent autonomy. A competitive salary package is on offer, coupled with long-term and stable career prospects. You will gain top-tier exposure to defence industry projects and leaders, working in an excellent culture.\nWhat you need to do now\nIf you're interested in this role, click 'apply now' or forward your resume directly to\namy.mcnulty@hays.com.au\nDon't miss out..... reach out today !\n#HaysDefence\nDon’t provide your bank or credit card details when applying for jobs.\n⁠\nFeatured jobs\nTech Lead\nThe Onset\n2d ago\nFull Stack Developer\nAerotrack Systems\nMilton, Brisbane QLD\n7d ago\nResearching careers? Find all the information and tips you need on career advice.\nRole descriptions\nSalary insights\nTools to help you prepare for jobs\nExplore Career Advice",
  "jobId": "87132491",
  "location": "Sydney NSW",
  "posted": "",
  "raw_title": "Software Discipline Lead\nHays | Defence\nSydney NSW\nFull time\nRelocation Assistance",
  "salary_note": "",
  "scrapedAt": "2025-09-18T03:50:53.915Z",
  "title": "Software Discipline Lead",
  "url": "https://www.seek.com.au/rust-jobs/in-All-Sydney-NSW?jobId=87132491&type=standard",
  "work_type": "Full time"
}