{
  "application_volume": "",
  "category": "$165-200k base + super + ESOP",
  "company": "Real Time",
  "debug": {
    "details_length": 2699,
    "extracted_company": "Real Time",
    "extracted_title": "Senior Software Engineer",
    "title_length": 94
  },
  "details": "Senior Software Engineer\nReal Time\nSydney NSW\n(Hybrid)\nEngineering - Software (Information & Communication Technology)\nFull time\n$165-200k base + super + ESOP\nPosted 1d ago\n•\nMedium application volume\nHow you match\nMatches based on your career history\nAPI\nTypescript Programming\nPython Programming\nShow all\n⁠\nTiming is everything!\nAre you looking for a role, company, or product at the perfect point of financial backing, scale, and growth, while still maintaining a grassroots feel? Where you are able to make a real impact as an individual contributor?\nJoin one of Australia’s fastest-growing digital companies, on the path to unicorn status. With thousands of active users and rapid global expansion underway, the business is doubling down on product, platform, and AI innovation.\nAs a\n, you’ll play a key role in building and scaling the platform. You’ll work alongside Staff Engineers and Engineering Managers to design robust systems, ship high-quality code, and solve complex technical challenges at pace.\nThis isn’t just about writing features — it’s about shaping how a modern, high-growth platform evolves while making an immediate impact on millions of users.\nWhat you’ll do\nDesign, build, and ship scalable services in Golang or similar: Typescript, Python, Scala, Kotlin, Elixir, Rust\nContribute to system architecture and technical decision-making\nCollaborate with product, design, and engineering teams to deliver features at pace\nWork across microservices, APIs, GraphQL, and gRPC-based systems\nMentor mid-level engineers and raise the technical bar\nImprove performance, developer experience, and long-term scalability\nAbout you\nFull Stack Software Engineer with strong capabilities on the backend\nComfortable working in a fast-paced scaleup environment where priorities shift and big problems need solving\nLove collaboration, have your thoughts and opinions heard\nYou’ll work on scaling challenges that span:\nEvolving a microservices ecosystem (40+ services and growing)\nBuilding integrations with modern health devices and wearables\nReal-time engagement: live updates, offline modes, interactive plans\nAI-powered developer tooling and observability\nThis is your chance to make an impact in a global-scale HealthTech business, partner with top engineers and product leaders, and grow your career in a company that values both speed and technical excellence.\nApply via the link — we’d love to connect you with this opportunity.\nDon’t provide your bank or credit card details when applying for jobs.\nFeatured jobs\nSenior Full-Stack Developer\nVisualise Reporting Australia\n1d ago\nPlenti\n2d ago\nDataMesh\n7d ago\nWhat can I earn as a Software Engineer\nSee more detailed salary information",
  "jobId": "87229033",
  "location": "Sydney NSW (Hybrid)",
  "posted": "",
  "raw_title": "Senior Software Engineer\nReal Time\nSydney NSW (Hybrid)\nFull time\n$165-200k base + super + ESOP",
  "salary_note": "$165-200k base + super + ESOP",
  "scrapedAt": "2025-09-18T04:52:18.573Z",
  "title": "Senior Software Engineer",
  "url": "https://www.seek.com.au/rust-jobs/in-All-Sydney-NSW?jobId=87229033&type=standard",
  "work_type": "Full time"
}