{
  "url": "http://localhost:3000/api/questionAndAnswers",
  "method": "POST",
  "headers": {
    "Content-Type": "application/json",
    "Accept": "application/json",
    "Authorization": "Bearer rag_fca49fc84e52dca593582748bca7bdf4_69df6f622b39cad3fe6229a2530a31a3d03c6a5bb47ec702497613d56b309409"
  },
  "body": {
    "questions": [
      {
        "q": "Please describe your experience with React development",
        "opts": []
      }
    ],
    "userEmail": "puskarwagle17@gmail.com",
    "jobDetails": {
      "title": "Full Stack Developer (Junior to Mid-level)",
      "company": "1Cover",
      "description": "We are a leading travel insurance provider with a strong focus on technology. We let our insights, innovative thinking, and customer-centric approach drive the business. At 1Cover, we believe that travelers should explore the world and return home safely. That's why we offer travel insurance that you can count on.\nWe are a travel insurance brand unlike any other - we are quirky, fun, and charismatic.\nAt present, we are looking for a Junior to Mid Full-stack Java Spring Developer to join our DevOps team. This position will provide a fantastic opportunity for a smart and ambitious software developer to grow within the team, gain valuable industry experience and develop professionally.\nYour role will involve:\nContributing to the development of our core insurance platform and its websites and APIs, with a broad use of Java and the Spring Framework.\nCreating SQL queries for use in OLTP databases, data pipeline, and data warehouse;\nTaking ideas, requirements, bug reports, UX wireframes, 3rd-party API specifications and working through them with team members and stakeholders to design appropriate, and sometimes innovative, solutions to business problems.\nBuilding website and application front-ends using natural templating via Thymeleaf, and REST via AJAX with Angular and React.\nTesting your work thoroughly, as well as getting involved in code reviews and retrospectives to improve the work of other team members.\nTake charge of your own Continuous Professional Development with mentoring provided by our senior team members.\nHere’s what we are looking for in candidates for this job:\nAs this is a Junior position, we are looking for someone with relevant experience who is passionate about coding, learning and innovating;\nAt least a Bachelor Degree and 12 months of experience, or 5 years of experience in lieu of qualification;\nThe ability to write good practical core Java code, and to read and understand the source code of 3rd-party frameworks and libraries - with commercial experience of using them appropriately;\nA diverse range of complementary experience, with an awareness of software engineering practices;\nFamiliarity with other programming and scripting languages, and understand their use in build tools;\nYou must be able to gain a thorough understanding of the insurance business, so that you can design and build appropriate solutions;\nWe need you to have excellent attention to detail and communication skills; and\nFinally, we care about our customers and our colleagues and we want you to do the same."
    }
  },
  "timestamp": "2025-09-28T02:01:10.408Z"
}